Revit 2027 API
Document.SetUnits Method
 Sets the units.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetUnits(
	Units units
)
Public Sub SetUnits (
	units As Units
)
public:
void SetUnits(
	Units^ units
)
member SetUnits :
        units : Units -> unit
Parameters
units Units
 The units.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
Document Class
Autodesk.Revit.DB Namespace